# <h1 align="center" color="red"><span style="color: red;">PANDAS</span></h1>

# <span style="color: green;">Getting start with pandas</span>

In [2]:
import pandas as pd

# <span style="color: green;">Data frame</span>

In [26]:
#There are two core objects in pandas: Dataframe, Series
#Data frame reperent a table
#Create a dataframe
sample=pd.DataFrame({'Name':['Kamal','Amal'],'Marks':[56,89]})         # the function DataFrame is case sensitive
print(sample)
#In this example Name and Marks are column name and Kamal,Amal,56,89 are called values
#When observing the syntax this look like a dictionary, where columns are keys and values/entries are in side the list

print('\n')
#Another way of creating Dataframes
fruits = pd.DataFrame([[30, 21]], columns=['Apples', 'Bananas'])
print(fruits)

    Name  Marks
0  Kamal     56
1   Amal     89


   Apples  Bananas
0      30       21

In [8]:
#Here row labels are assigned automatically 0,1,2,3,4,....; However user can modify it
#Row labels are called index in dataframe
pd.DataFrame({'Name':['Kamal','Amal'],'Marks':[56,89]},index=['student_1','student_2'])

            Name  Marks
student_1  Kamal     56
student_2   Amal     89

# <span style="color: green;">Series</span>

In [27]:
#Series is a single columned table/Data frame
#Data frame and series are related , Data frame is a bunch of series
#Create a series
pd.Series([200,123,254])# Series is case sensitive

0    200
1    123
2    254
dtype: int64

In [16]:
#like dataframe, series also have row names as indexes and it can be modified
pd.Series([200,123,254],index=['2015 sales','2016 sales','2017 sales'])

2015 sales    200
2016 sales    123
2017 sales    254
dtype: int64

In [17]:
#Unlike dataframe series doesnot have a column name ,However it has an overall name
pd.Series([200,123,254],index=['2015 sales','2016 sales','2017 sales'],name='Sales of ABC company')

2015 sales    200
2016 sales    123
2017 sales    254
Name: Sales of ABC company, dtype: int64

# <span style="color: green;">Reading a data file</span>

In [31]:
#Instead of create a dataframe , we can use predefined data sets for further analysis
#use pd.read_csv() function to read a data set
salary_data=pd.read_csv('Salaries.csv',index_col=0)
#'index_col=0' is optional if we put this in code extra row index columns will be hided
#shape atrribute used to see how large the data set is
print(salary_data.shape)
#head() function will generate first 5 rows from the data framer
salary_data.head()

(148654, 12)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
Id,,,,,,,,,,,,
1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

# <span style="color: green;">Creat a data(CSV) file</span>

In [32]:
animals = pd.DataFrame({'Cows': [12, 20], 'Goats': [22, 19]}, index=['Year 1', 'Year 2'])
#to_csv() used to save data frame in local pc
animals.to_csv("cows_and_goats.csv")

In [33]:
pd.read_csv('cows_and_goats.csv',index_col=0)

        Cows  Goats
Year 1    12     22
Year 2    20     19